app/controllers/backend/cargos_controller.rb

  def create
    @cargo = Cargo.new(params[:cargo])
    if @cargo.save
---
INSERT INTO "cargos" ("updated_at", "descricao", "created_at") VALUES('2010-03-25 00:06:28.207000', E'', '2010-03-25 00:06:28.207000') RETURNING "id"

  def edit
    @cargo = Cargo.find(params[:id])
---
SELECT * FROM "cargos" WHERE ("cargos"."id" = 9)