app/controllers/backend/cursos_controller.rb

INSERT INTO "cursos" ("updated_at", "funcionario_id", "nome", "visaogeral", "duracao", "carreira", "created_at") VALUES('2010-03-30 11:20:15.512000', NULL, E'teste', E'teste', E'teste', E'teste', '2010-03-30 11:20:15.512000') RETURNING "id"
---
  def create
    @curso = Curso.new(params[:curso])
    if @curso.save

SELECT * FROM "cursos" WHERE ("cursos"."id" = 1)
---
  def edit
    @curso = Curso.find(params[:id])