app/controllers/backend/discentes_controller.rb

  def create
    @discente = Discente.new(params[:discente])
    if @discente.save
---
INSERT INTO "discentes" ("curso_id", "updated_at", "account_id", "ra", "created_at") VALUES(1, '2010-03-30 11:30:27.361000', 2, E'aaa', '2010-03-30 11:30:27.361000') RETURNING "id"

  def edit
    @discente = Discente.find(params[:id])
---
SELECT * FROM "discentes" WHERE ("discentes"."id" = 1)