app/controllers/backend/disciplinas_controller.rb

  def create
    @disciplina = Disciplina.new(params[:disciplina])
    if @disciplina.save
---
INSERT INTO "disciplinas" ("updated_at", "nome", "ementa", "objetivo", "created_at") VALUES('2010-03-30 11:04:34.338000', E'a', E'&nbsp;', NULL, '2010-03-30 11:04:34.338000') RETURNING "id"

  def edit
    @disciplina = Disciplina.find(params[:id])
---
SELECT * FROM "disciplinas" WHERE ("disciplinas"."id" = 1)