app/controllers/backend/docentes_controller.rb

  def create
    @docente = Docente.new(params[:docente])
    if @docente.save
---
INSERT INTO "docentes" ("twitter", "updated_at", "blog", "account_id", "nome", "lattes", "escolaridade_id", "ativo", "msn", "email", "created_at") VALUES(E'a', '2010-03-30 12:39:23.549000', E'a', NULL, E'a', E'a', NULL, 'f', E'a', E'a', '2010-03-30 12:39:23.549000') RETURNING "id"

  def edit
    @docente = Docente.find(params[:id])
---
SELECT * FROM "docentes" WHERE ("docentes"."id" = 2)