app/controllers/backend/eventos_controller.rb

  def create
    @evento = Evento.new(params[:evento])
    if @evento.save
---
INSERT INTO "eventos" ("datainicial", "local", "datafinal", "updated_at", "nome", "inscritos", "descricao", "created_at") VALUES('2010-04-01', E'Fatec', '2010-04-28', '2010-04-05 18:36:56.466000', E'Curso de Java', 10, E'Curso de Java', '2010-04-05 18:36:56.466000') RETURNING "id"

  def edit
    @evento = Evento.find(params[:id])
---
SELECT * FROM "eventos" WHERE ("eventos"."id" = 1)

  def update
    @evento = Evento.find(params[:id])

    if @evento.update_attributes(params[:evento])
---
SELECT * FROM "eventos" WHERE ("eventos"."id" = 1)
UPDATE "eventos" SET "datainicial" = '2010-04-05', "datafinal" = '2010-04-30', "updated_at" = '2010-04-05 18:40:54.899000' WHERE "id" = 1