app/controllers/backend/funcionarios_controller.rb

  def create
    @funcionario = Funcionario.new(params[:funcionario])
    if @funcionario.save
---
INSERT INTO "funcionarios" ("cargo_id", "updated_at", "nome", "escolaridade_id", "email", "created_at") VALUES(NULL, '2010-03-30 13:26:06.399000', E'teste', NULL, E'', '2010-03-30 13:26:06.399000') RETURNING "id"

  def edit
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)

  def update
    @funcionario = Funcionario.find(params[:id])

    if @funcionario.update_attributes(params[:funcionario])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)
UPDATE "funcionarios" SET "cargo_id" = 5, "escolaridade_id" = 1, "updated_at" = '2010-03-30 13:26:26.748000' WHERE "id" = 1