app/controllers/backend/inscricaos_controller.rb

INSERT INTO "inscricaos" ("updated_at", "account_id", "observacao", "evento_id", "created_at") VALUES('2010-04-12 16:42:10.280000', 1, E'', 1, '2010-04-12 16:42:10.280000') RETURNING "id"
---
  def create
      @inscricao = Inscricao.new(params[:inscricao])
      if @inscricao.save

SELECT * FROM "inscricaos" WHERE ("inscricaos"."id" = 1)
---
  def edit
    @inscricao = Inscricao.find(params[:id])

SELECT * FROM "inscricaos" WHERE ("inscricaos"."id" = 5)
---
  def update
    @inscricao = Inscricao.find(params[:id])