app/controllers/backend/noticias_controller.rb

INSERT INTO "noticias" ("fonte", "categorianoticia_id", "updated_at", "titulo", "textocurto", "datafim", "datainicio", "vejamais", "textolongo", "created_at") VALUES(E'b', 4, '2010-03-30 14:32:53.611000', E'a', E'b', '2010-03-31', '2010-03-09', E'a', E'b', '2010-03-30 14:32:53.611000') RETURNING "id"
---
  def create
    @noticia = Noticia.new(params[:noticia])
    if @noticia.save

SELECT * FROM "noticias" WHERE ("noticias"."id" = 1)
---
  def edit
    @noticia = Noticia.find(params[:id])

SELECT * FROM "noticias" WHERE ("noticias"."id" = 3)
UPDATE "noticias" SET "datafim" = '2010-12-31', "vejamais" = E'http://www.vestibularfatec.com.br', "fonte" = E'Centro Paula Souza', "textolongo" = E'Vai ato o dia até 8 de abril o prazo para solicitar isenção e redução de 50% na taxa de inscrição para o Vestibular das Faculdades de Tecnologia (Fatecs) do Estado de São Paulo para o 2º semestre de 2010 – no último dia, o prazo termina às 15 horas.', "updated_at" = '2010-04-19 14:07:22.154000' WHERE "id" = 5
---
  def update
    @noticia = Noticia.find(params[:id])

    if @noticia.update_attributes(params[:noticia])

DELETE FROM "noticias" WHERE "id" = 3
SELECT * FROM "noticias" WHERE ("noticias"."id" = 3)
---
  def destroy
    if Noticia.find(params[:id]).destroy