app/controllers/backend/tags_controller.rb

  def create
    @tag = Tag.new(params[:tag])
    if @tag.save
---
INSERT INTO "tags" ("updated_at", "descricao", "created_at") VALUES('2010-03-30 11:00:46.370000', E'Notícias', '2010-03-30 11:00:46.370000') RETURNING "id"

  def edit
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 11)

  def update
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 11)

  def destroy
    if Tag.find(params[:id]).destroy
---
DELETE FROM "tags" WHERE "id" = 11
SELECT * FROM "tags" WHERE ("tags"."id" = 11)