app/controllers/principal_controller.rb

SELECT * FROM "noticias" WHERE ("noticias"."id" = 5)
---
  def detalhes
  @noticia = Noticia.find(params[:id].to_i)

SELECT * FROM "noticias" WHERE (LOWER(titulo) LIKE E'%a%' or LOWER(textocurto) LIKE E'%a%' or LOWER(textolongo) LIKE E'%a%')
---
  def procurar
      @termo = params[:busca].downcase
	  @noticias = Noticia.find(:all, :conditions => ["LOWER(titulo) LIKE ? or LOWER(textocurto) LIKE ? or LOWER(textolongo) LIKE ?", '%'+@termo+'%','%'+@termo+'%','%'+@termo+'%'])